{
    "format": "graph-model",
    "generatedBy": "2.19.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "signature": {
        "inputs": {
            "input": {
                "name": "input:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "1"
                        }
                    ]
                }
            }
        },
        "outputs": {
            "output_0": {
                "name": "Identity:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "1"
                        }
                    ]
                }
            }
        }
    },
    "modelTopology": {
        "node": [
            {
                "name": "StatefulPartitionedCall/functional_1_1/dense_1_1/Cast/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "3"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_1_1/dense_1_1/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_1_1/dense_2_1/Cast/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_1_1/dense_2_1/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_1_1/dense_3_1/Cast/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_1_1/dense_3_1/Add/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "input",
                "op": "Placeholder",
                "attr": {
                    "shape": {
                        "shape": {
                            "dim": [
                                {
                                    "size": "-1"
                                },
                                {
                                    "size": "1"
                                }
                            ]
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_1_1/dense_1_1/BiasAdd",
                "op": "_FusedMatMul",
                "input": [
                    "input",
                    "StatefulPartitionedCall/functional_1_1/dense_1_1/Cast/ReadVariableOp",
                    "StatefulPartitionedCall/functional_1_1/dense_1_1/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "transpose_a": {
                        "b": false
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA=="
                            ]
                        }
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_1_1/dense_2_1/BiasAdd",
                "op": "_FusedMatMul",
                "input": [
                    "StatefulPartitionedCall/functional_1_1/dense_1_1/BiasAdd",
                    "StatefulPartitionedCall/functional_1_1/dense_2_1/Cast/ReadVariableOp",
                    "StatefulPartitionedCall/functional_1_1/dense_2_1/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "transpose_a": {
                        "b": false
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA=="
                            ]
                        }
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/functional_1_1/dense_3_1/Add",
                "op": "_FusedMatMul",
                "input": [
                    "StatefulPartitionedCall/functional_1_1/dense_2_1/BiasAdd",
                    "StatefulPartitionedCall/functional_1_1/dense_3_1/Cast/ReadVariableOp",
                    "StatefulPartitionedCall/functional_1_1/dense_3_1/Add/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "transpose_a": {
                        "b": false
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA=="
                            ]
                        }
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "Identity",
                "op": "Identity",
                "input": [
                    "StatefulPartitionedCall/functional_1_1/dense_3_1/Add"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            }
        ],
        "library": {},
        "versions": {
            "producer": 2129
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "MOD/tensorflow/group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "StatefulPartitionedCall/functional_1_1/dense_1_1/Cast/ReadVariableOp",
                    "shape": [
                        1,
                        3
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/functional_1_1/dense_1_1/BiasAdd/ReadVariableOp",
                    "shape": [
                        3
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/functional_1_1/dense_2_1/Cast/ReadVariableOp",
                    "shape": [
                        3,
                        3
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/functional_1_1/dense_2_1/BiasAdd/ReadVariableOp",
                    "shape": [
                        3
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/functional_1_1/dense_3_1/Cast/ReadVariableOp",
                    "shape": [
                        3,
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/functional_1_1/dense_3_1/Add/ReadVariableOp",
                    "shape": [
                        1
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}